{
  "backend/main.mo": "Main actor for the Smart City Infrastructure Risk Dashboard backend, defining data types (Infrastructure, Prediction, BudgetEstimate, etc.), user profile management with access control, and risk scoring/prediction logic for infrastructure records.",
  "backend/migration.mo": "Migration module that upgrades stored infrastructure records from the old schema (no photo) to the new schema by adding a null `photoBase64` field, and drops the `syntheticData` field.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (useAnalyzeAndPredict hook, Add Infrastructure page, edit form photo upload) to their source files, components, and test requirement IDs.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-line descriptions of each frontend source file, serving as a quick reference for the purpose and key changes in every component and page.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, chart colors, sidebar, etc.).",
  "frontend/index.html": "HTML shell for the React app that loads Leaflet and leaflet.heat via CDN script tags and mounts the React root div.",
  "frontend/src/App.tsx": "TanStack Router setup defining all application routes (dashboard, map, budget, analytics, infrastructure detail, and the new `/add` route) wrapped in the shared Layout component.",
  "frontend/src/components/AgeRiskScatterPlot.tsx": "Recharts scatter plot component that visualizes infrastructure age vs. risk score, with separate series for bridges and roads and a custom tooltip.",
  "frontend/src/components/AnimatedCounter.tsx": "Reusable React component that animates a numeric value from zero to a target using requestAnimationFrame with an ease-out cubic curve.",
  "frontend/src/components/AreaHealthChart.tsx": "Bar chart component that displays average health scores per city area, with a reference line for the overall average and color-coded bars for below/above average areas.",
  "frontend/src/components/BudgetByRiskChart.tsx": "Bar chart component that visualizes estimated maintenance budget split across low, moderate, and high risk categories with color-coded bars.",
  "frontend/src/components/BudgetByTypeChart.tsx": "Donut pie chart component that shows estimated maintenance budget distribution between bridges and roads based on infrastructure data.",
  "frontend/src/components/BudgetOptimization.tsx": "Component that ranks the top 3 infrastructure structures by ROI index (risk reduction per dollar) and displays their estimated costs and risk details.",
  "frontend/src/components/ConditionChart.tsx": "Area chart component that projects a structure's condition rating over time (now, +5, +10, +20 years) with a critical threshold reference line.",
  "frontend/src/components/FilterPanel.tsx": "Sidebar filter panel with dropdowns for risk level, structure type, city area, and maintenance urgency, plus a reset button, using a shared FilterContext.",
  "frontend/src/components/HealthDistributionHistogram.tsx": "Bar chart histogram that buckets infrastructure structures into five health score ranges (0–100) with color-coded bars from red to green.",
  "frontend/src/components/HeroSection.tsx": "Hero banner component displaying animated summary stats (total structures, high-risk count, average health score), a refresh button, and a background image with gradient overlays.",
  "frontend/src/components/InfrastructureComparison.tsx": "Renders a side-by-side comparison table for multiple infrastructure items, displaying metrics like risk score, health, material, condition ratings, predictions, and budget estimates fetched via React Query hooks.",
  "frontend/src/components/InfrastructureEditForm.tsx": "Provides a form for editing an existing infrastructure record, supporting photo upload with auto-triggered AI analysis to suggest structural condition ratings, and submitting updates via a mutation hook.",
  "frontend/src/components/InfrastructureMap.tsx": "Renders an interactive Leaflet map displaying infrastructure items as color-coded markers by risk level, with popups showing key metrics like risk score, health, and maintenance year.",
  "frontend/src/components/InfrastructureTable.tsx": "Displays a sortable table of infrastructure items with columns for name, type, area, age, risk score, risk level, health, and maintenance year, with navigation to detail pages.",
  "frontend/src/components/Layout.tsx": "Defines the main app shell with a sticky top navigation bar, collapsible sidebar, and a filter panel, wrapping page content inside a FilterProvider context.",
  "frontend/src/components/PhotoUpload.tsx": "A drag-and-drop/click photo upload component that validates JPEG/PNG files under 5MB, converts them to base64, and displays a preview with replace/remove controls.",
  "frontend/src/components/PredictionResultsPanel.tsx": "Displays AI prediction results for an infrastructure structure, including risk score, health score, deterioration rate, maintenance year, and budget estimate, with a loading skeleton state.",
  "frontend/src/components/PredictionSuggestionsPanel.tsx": "Shows AI-suggested values (risk score, condition rating, deterioration rate, maintenance year, estimated cost) derived from a prediction result, with accept and dismiss actions.",
  "frontend/src/components/PriorityList.tsx": "Renders a sorted list of infrastructure structures by risk score, showing estimated repair cost and recommended action, with navigation to each structure's detail page.",
  "frontend/src/components/RiskBadge.tsx": "A small presentational badge component that displays a color-coded risk level label (HIGH, MOD, LOW) in two sizes.",
  "frontend/src/components/RiskGauge.tsx": "A radial bar chart gauge that visually represents a 0–1 risk score as a percentage with a color-coded arc using Recharts.",
  "frontend/src/components/SensorSimulation.tsx": "A toggleable sensor simulation panel that displays live-updating condition rating, traffic load, risk score, and health score metrics when active.",
  "frontend/src/components/SummaryStats.tsx": "Displays a grid of animated summary statistics for a list of infrastructure items, including total count, high/moderate/low risk counts, and average health score.",
  "frontend/src/contexts/FilterContext.tsx": "Provides a React context for filtering infrastructure items by risk level, structure type, area, and urgency, with a `filterInfrastructure` function that applies all active filters.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) access, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via `AuthClient`, exposing login/logout functions, identity state, and login status through a React context provider and `useInternetIdentity` hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including fetching, adding, updating, and deleting infrastructure records, as well as budget estimates and AI predictions.",
  "frontend/src/hooks/useSensorSimulation.ts": "Hook that simulates live sensor data by periodically randomizing condition rating and traffic load, computing derived risk and health scores, with toggle and stop controls.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind CSS, and defines light/dark CSS custom properties for a government intelligence-themed UI along with utility classes for glows, animations, and typography.",
  "frontend/src/lib/utils.ts": "Utility functions for extracting Motoko variant enum keys, formatting currency, risk levels, structure types, material types, urgency levels, and computing health scores from risk scores.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AddInfrastructure.tsx": "Form page for adding new infrastructure records, supporting photo upload, AI-based analysis/prediction, and saving to the backend with navigation to the detail view on success.",
  "frontend/src/pages/Analytics.tsx": "Analytics page displaying charts for age vs. risk, area health scores, health score distribution, and side-by-side infrastructure comparison using data from all infrastructure records.",
  "frontend/src/pages/BudgetPlanning.tsx": "Budget planning page showing city-wide maintenance cost estimates broken down by risk level and structure type, with a priority list and budget optimization tools.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying a hero section, summary statistics, and a filterable infrastructure table with refresh support.",
  "frontend/src/pages/InfrastructureDetail.tsx": "Detail page for a single infrastructure record showing risk gauge, condition chart, sensor simulation, budget estimate, and an inline edit form.",
  "frontend/src/pages/MapView.tsx": "Map page rendering all filtered infrastructure assets on an interactive map with a risk-level legend and loading placeholder.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those parameters via sessionStorage and history.replaceState.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom color palettes (navy, teal, amber), typography/mono fonts, border radius, box shadows, and animation keyframes for the dashboard theme.",
  "project_state.json": "Project state manifest describing the Smart City Infrastructure Risk Dashboard's architecture, tech stack, existing features, and requirements across the React frontend, Node.js backend, Python ML microservice, and PostgreSQL database."
}