{
  "backend/main.mo": "Motoko actor defining the smart city infrastructure risk backend with types for Infrastructure, Prediction, BudgetEstimate, and CityBudgetSummary, plus risk scoring logic, synthetic seed data, and CRUD/query endpoints.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs and titles to their implementing source files, component dependencies, and test IDs for the smart city dashboard project.",
  "frontend-file-summaries.txt": "JSON document providing one-sentence summaries of each frontend source file, serving as a quick reference for the purpose of each page and component.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property tokens for light and dark themes including background, foreground, chart, and sidebar colors.",
  "frontend/index.html": "HTML shell that loads Leaflet and leaflet.heat via CDN and mounts the React app at the root div.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for Dashboard, MapView, BudgetPlanning, Analytics, and InfrastructureDetail, all wrapped in the shared Layout.",
  "frontend/src/components/AgeRiskScatterPlot.tsx": "Recharts scatter plot component that visualizes infrastructure age vs. risk score, with separate series for bridges and roads and a custom styled tooltip.",
  "frontend/src/components/AnimatedCounter.tsx": "Reusable React component that animates a numeric value from zero to a target using requestAnimationFrame with an ease-out cubic curve.",
  "frontend/src/components/AreaHealthChart.tsx": "Recharts bar chart component that computes and displays average health scores per city area, highlighting bars below the overall average in amber.",
  "frontend/src/components/BudgetByRiskChart.tsx": "Recharts bar chart component that renders estimated maintenance budget broken down by low, moderate, and high risk levels with color-coded bars.",
  "frontend/src/components/BudgetByTypeChart.tsx": "Renders a donut pie chart breaking down estimated maintenance budget between bridges and roads using Recharts, with costs calculated from risk level and age.",
  "frontend/src/components/BudgetOptimization.tsx": "Displays the top 3 infrastructure structures ranked by ROI (risk score per dollar), showing estimated cost and risk reduction potential for budget prioritization.",
  "frontend/src/components/ConditionChart.tsx": "Renders an area chart showing projected structural condition ratings at current, +5, +10, and +20 year intervals, with a critical threshold reference line.",
  "frontend/src/components/FilterPanel.tsx": "Provides a sidebar filter UI with dropdowns for risk level, structure type, city area, and maintenance urgency, backed by a FilterContext.",
  "frontend/src/components/HealthDistributionHistogram.tsx": "Renders a color-coded bar chart histogram showing the distribution of infrastructure structures across five health score ranges (0–100).",
  "frontend/src/components/HeroSection.tsx": "Displays a hero banner with animated counters for total structures, high-risk count, and average health score, plus a manual refresh button and last-refresh timestamp.",
  "frontend/src/components/InfrastructureComparison.tsx": "Renders a side-by-side comparison table for selected infrastructure items, showing detailed attributes including risk, health, predictions, and budget estimates fetched via React Query hooks.",
  "frontend/src/components/InfrastructureEditForm.tsx": "A form component for editing infrastructure records, with fields for name, age, traffic load, material type, environmental exposure, structural condition, and notes, using a mutation hook to submit updates.",
  "frontend/src/components/InfrastructureMap.tsx": "A Leaflet-based map component that renders infrastructure items as colored circle markers with popups showing risk, health, and maintenance info, using the globally loaded Leaflet CDN library.",
  "frontend/src/components/InfrastructureTable.tsx": "A sortable table component displaying infrastructure records with columns for name, type, area, age, risk score, risk level, health, maintenance year, and a navigation action button.",
  "frontend/src/components/Layout.tsx": "The main app layout component providing a sticky top navigation bar, a collapsible sidebar with a filter panel, and a main content area, wrapped in a FilterProvider context.",
  "frontend/src/components/PriorityList.tsx": "Displays a sorted list of infrastructure items by risk score, showing estimated repair cost, recommended action, and risk badge, with click navigation to individual detail pages.",
  "frontend/src/components/RiskBadge.tsx": "A small presentational badge component that renders a color-coded HIGH/MOD/LOW label based on a risk key string, with optional size variants.",
  "frontend/src/components/RiskGauge.tsx": "A radial bar chart gauge that visualizes a 0–1 risk score as a percentage with a color-coded arc (green/amber/red) and a centered numeric label.",
  "frontend/src/components/SensorSimulation.tsx": "React component that displays a toggleable sensor simulation panel showing live condition rating, traffic load, risk score, and health score metrics with color-coded indicators.",
  "frontend/src/components/SummaryStats.tsx": "React component that renders a grid of summary stat cards (total structures, high/moderate/low risk counts, average health score) derived from an array of Infrastructure items using animated counters.",
  "frontend/src/contexts/FilterContext.tsx": "React context providing filter state (risk level, structure type, area, urgency) and a filterInfrastructure function that applies those filters to an Infrastructure array.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom hook and provider that manages Internet Identity authentication state (login, logout, identity persistence) via DFINITY's AuthClient, exposing identity and login status to child components.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for CRUD operations on infrastructure data (fetch all, fetch by ID, add, update, delete) plus queries for predictions, budget estimates, and city budget summary.",
  "frontend/src/hooks/useSensorSimulation.ts": "Custom hook that simulates live sensor data by randomly fluctuating condition rating and traffic load every 3 seconds, computing derived risk and health scores, with toggle and stop controls.",
  "frontend/src/index.css": "Global stylesheet that imports Inter and JetBrains Mono fonts, sets up Tailwind base/components/utilities, and defines CSS custom properties for light/dark themes along with utility classes for glows, animations, and color accents.",
  "frontend/src/lib/utils.ts": "Utility functions for the frontend including Tailwind class merging, enum key extraction for backend types (RiskLevel, StructureType, etc.), and formatting helpers for currency, risk levels, material types, and health scores.",
  "frontend/src/main.tsx": "React app entry point that renders the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Analytics.tsx": "Analytics page that displays infrastructure data through four charts: an age vs. risk scatter plot, area health bar chart, health score distribution histogram, and a side-by-side infrastructure comparison tool.",
  "frontend/src/pages/BudgetPlanning.tsx": "Budget Planning page showing city-wide maintenance cost estimates broken down by risk level and structure type, with a priority list and budget optimization section.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that fetches all infrastructure records, applies filters, and renders a hero section, summary stats, and a filterable infrastructure table.",
  "frontend/src/pages/InfrastructureDetail.tsx": "Detail page for a single infrastructure asset showing risk gauge, condition chart, sensor simulation, budget estimate, and an editable form, with support for live simulated sensor values overlaying real data.",
  "frontend/src/pages/MapView.tsx": "React page that displays a filterable city infrastructure map using InfrastructureMap component, with a header showing structure counts by risk level (high/moderate/low) and a map legend. Shows a placeholder image while data is loading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom color palettes (navy, teal, amber), fonts (Inter, JetBrains Mono), border radius, box shadows, and plugin imports for typography, container queries, and animations.",
  "project_state.json": "Project state manifest describing the Smart City Infrastructure Risk Dashboard's architecture, tech stack (React, Node.js, Python ML microservice, PostgreSQL), existing features, known issues, and image requirements."
}