{
  "kind": "build_request",
  "title": "Photo Upload with Auto-Prediction for Infrastructure Records",
  "projectName": "Smart City Infrastructure Dashboard",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-16",
      "text": "Add a photo upload field to the infrastructure add/edit form. Accept JPEG/PNG images (max 5MB). Store the uploaded image as a Base64-encoded blob in the backend Infrastructure record by adding an optional `photoBase64: ?Text` field to the Motoko data type. Update `addInfrastructure` and `updateInfrastructure` to accept and persist this field.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "whenever i upload the photo and full detail of bridage and road it also predicte the full dtail"
        ]
      },
      "acceptanceCriteria": [
        "Infrastructure Motoko type includes an optional `photoBase64: ?Text` field",
        "addInfrastructure and updateInfrastructure accept the photo blob",
        "Stored photo can be retrieved via getInfrastructureById"
      ]
    },
    {
      "id": "REQ-17",
      "text": "Implement a deterministic image-based condition analysis function in Motoko. When a photo is uploaded alongside infrastructure parameters, derive a simulated visual condition score (0.0–5.0) from the Base64 image hash combined with structural parameters (age, materialType, environmentalExposureFactor). Use this derived score to auto-compute and return: riskScore, riskLevel, deteriorationRate, predicted maintenanceYear, and budgetEstimate. Expose this as a query/update function `analyzeAndPredict(record: InfrastructureInput): PredictionResult`.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "whenever i upload the photo and full detail of bridage and road it also predicte the full dtail"
        ]
      },
      "acceptanceCriteria": [
        "analyzeAndPredict function exists and accepts full infrastructure details including photoBase64",
        "Returns riskScore, riskLevel, structuralConditionRating (derived), deteriorationRate, maintenanceYear, estimatedCost, and recommendedAction",
        "The photo hash is incorporated into condition score derivation so different images produce different results",
        "Results are consistent with the existing risk scoring formula"
      ]
    },
    {
      "id": "REQ-18",
      "text": "Add a React Query hook `useAnalyzeAndPredict` in `frontend/src/hooks/useQueries.ts` that calls the backend `analyzeAndPredict` function with infrastructure form data including the uploaded photo Base64 string.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "whenever i upload the photo and full detail of bridage and road it also predicte the full dtail"
        ]
      },
      "acceptanceCriteria": [
        "useAnalyzeAndPredict hook is exported from useQueries.ts",
        "It accepts a full infrastructure input object including optional photoBase64",
        "It calls the backend analyzeAndPredict endpoint and returns typed results"
      ]
    },
    {
      "id": "REQ-19",
      "text": "Build a new 'Add / Analyze Infrastructure' page (route `/add`) accessible from the top navigation bar. The page must include: a full infrastructure details form (name, structureType, area, age, trafficLoadFactor, materialType, environmentalExposureFactor, structuralConditionRating, notes), a photo upload widget with drag-and-drop and file-picker support showing a preview thumbnail, an 'Analyze & Predict' button that calls the backend analyzeAndPredict function, and an auto-populated Prediction Results panel that appears after analysis showing: risk score with colored badge, risk level, health score progress bar, deterioration rate, forecasted maintenance year, estimated budget cost, and recommended action. A 'Save to Database' button saves the record (with photo) to the backend.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "whenever i upload the photo and full detail of bridage and road it also predicte the full dtail"
        ]
      },
      "acceptanceCriteria": [
        "Route /add is registered in App.tsx and linked from the top nav bar",
        "Photo upload widget accepts JPEG/PNG, shows thumbnail preview, and converts image to Base64",
        "Form validates all required fields before enabling Analyze & Predict",
        "Clicking Analyze & Predict shows a loading state and then populates the prediction results panel",
        "Prediction results panel shows riskScore badge, riskLevel, healthScore bar, deteriorationRate, maintenanceYear, estimatedCost, and recommendedAction",
        "Save to Database button persists the full record including photo and predicted values to the backend",
        "On successful save, user is redirected to the Infrastructure Detail page for the new record",
        "Page styling matches the dark-mode government intelligence theme (deep navy, teal/amber accents, monospace typography, glow borders)"
      ]
    },
    {
      "id": "REQ-20",
      "text": "Update the existing `InfrastructureEditForm` component to include a photo upload field. When a new photo is uploaded on an existing record, re-run the analyzeAndPredict function and show updated prediction suggestions in a side panel next to the form. The user can accept the suggested values (auto-fill form fields) or dismiss them.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "whenever i upload the photo and full detail of bridage and road it also predicte the full dtail"
        ]
      },
      "acceptanceCriteria": [
        "Edit form includes a photo upload field with preview for existing and new photos",
        "Uploading a new photo triggers analyzeAndPredict and shows a suggestion panel",
        "Suggestion panel displays predicted riskScore, conditionRating, deteriorationRate, maintenanceYear, and budgetEstimate",
        "Accept Suggestions button auto-fills form fields with predicted values",
        "Dismiss button hides the suggestion panel without modifying form fields",
        "Photo is saved with the updated record on form submission"
      ]
    }
  ],
  "constraints": [
    "All image analysis and prediction logic must be implemented deterministically in Motoko — no external ML microservices or APIs",
    "Photo data must be stored as Base64 text within the Motoko stable storage — no external file storage",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "Maintain single-actor Motoko backend architecture"
  ],
  "nonGoals": [
    "Real computer vision or actual image recognition using ML models",
    "External image storage services (S3, IPFS, etc.)",
    "PDF report generation from uploaded photos",
    "Bulk photo upload for multiple structures at once"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}