{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Photo Upload with Auto-Prediction for Infrastructure Records",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Add React Query hook for analyzeAndPredict backend function",
      "acceptanceCriteria": [
        "useAnalyzeAndPredict hook is exported from useQueries.ts",
        "It accepts a full infrastructure input object including optional photoBase64",
        "It calls the backend analyzeAndPredict endpoint and returns typed results"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useAnalyzeAndPredict mutation hook that calls the backend analyzeAndPredict function with InfrastructureInput including optional photoBase64 field. The hook should use useMutation from React Query, accept an InfrastructureInput object, and return a PredictionResult containing riskScore, riskLevel, deteriorationRate, maintenanceYear, and budgetEstimate. Include proper error handling and loading states."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Build Add/Analyze Infrastructure page with photo upload and prediction results",
      "acceptanceCriteria": [
        "Route /add is registered in App.tsx and linked from the top nav bar",
        "Photo upload widget accepts JPEG/PNG, shows thumbnail preview, and converts image to Base64",
        "Form validates all required fields before enabling Analyze & Predict",
        "Clicking Analyze & Predict shows a loading state and then populates the prediction results panel",
        "Prediction results panel shows riskScore badge, riskLevel, healthScore bar, deteriorationRate, maintenanceYear, estimatedCost, and recommendedAction",
        "Save to Database button persists the full record including photo and predicted values to the backend",
        "On successful save, user is redirected to the Infrastructure Detail page for the new record",
        "Page styling matches the dark-mode government intelligence theme (deep navy, teal/amber accents, monospace typography, glow borders)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AddInfrastructure.tsx",
          "operation": "create",
          "description": "Create the Add/Analyze Infrastructure page with a comprehensive form including fields for name, structureType, area, age, trafficLoadFactor, materialType, environmentalExposureFactor, structuralConditionRating, and notes. Include a photo upload widget with drag-and-drop support, file picker (accepting JPEG/PNG up to 5MB), and thumbnail preview that converts uploaded images to Base64. Add an Analyze & Predict button that calls useAnalyzeAndPredict with the form data and photo. Display a Prediction Results panel after analysis showing: risk score with RiskBadge component, risk level text, health score progress bar (100 - riskScore), deterioration rate, forecasted maintenance year, estimated cost (formatted as currency), and recommended action. Include a Save to Database button that calls useAddInfrastructure with the full record including photo and predicted values, then redirects to /infrastructure/:id on success. Style with dark navy background, teal/amber accents, monospace typography for data fields, and glow borders matching the existing theme from frontend/src/index.css."
        },
        {
          "path": "frontend/src/components/PhotoUpload.tsx",
          "operation": "create",
          "description": "Create a reusable photo upload component that accepts JPEG/PNG images (max 5MB), provides drag-and-drop functionality, shows a file picker button, displays a thumbnail preview of the selected image, and converts the image to a Base64 string. The component should accept onChange callback to pass the Base64 string to the parent form, display file size validation errors, and provide a clear/remove button to delete the selected photo. Style with a dashed border glow effect for the drop zone, teal accent on hover, and dark navy background matching the application theme."
        },
        {
          "path": "frontend/src/components/PredictionResultsPanel.tsx",
          "operation": "create",
          "description": "Create a panel component that displays prediction results from the analyzeAndPredict function. Show riskScore with RiskBadge component, riskLevel as text, health score as a progress bar (calculated as 100 - riskScore), deteriorationRate as a percentage, maintenanceYear as a formatted year, estimatedCost formatted as currency using the currency formatter from frontend/src/lib/utils.ts, and recommendedAction as text. Style with dark background, teal/amber color coding for metrics, glow borders, and monospace typography for numeric values. Include a loading state skeleton when data is being fetched."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register the /add route in the router configuration, mapping to the AddInfrastructure page component. Ensure the route is wrapped in the Layout component for consistent navigation and sidebar."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Add a navigation link to the top navigation bar for the Add/Analyze Infrastructure page. The link should navigate to /add and be styled consistently with existing nav items (Dashboard, Map View, Budget Planning, Analytics). Include an icon (plus or upload symbol) and label 'Add Infrastructure'."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Update InfrastructureEditForm with photo upload and prediction suggestions",
      "acceptanceCriteria": [
        "Edit form includes a photo upload field with preview for existing and new photos",
        "Uploading a new photo triggers analyzeAndPredict and shows a suggestion panel",
        "Suggestion panel displays predicted riskScore, conditionRating, deteriorationRate, maintenanceYear, and budgetEstimate",
        "Accept Suggestions button auto-fills form fields with predicted values",
        "Dismiss button hides the suggestion panel without modifying form fields",
        "Photo is saved with the updated record on form submission"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/InfrastructureEditForm.tsx",
          "operation": "modify",
          "description": "Add a photo upload field to the existing edit form using the PhotoUpload component. Display the existing photoBase64 as a thumbnail preview if present. When a new photo is uploaded, automatically trigger the useAnalyzeAndPredict hook with the current form data plus the new photo Base64 string. Show a PredictionSuggestionsPanel side panel when prediction results are available. Include Accept Suggestions and Dismiss buttons in the panel. The Accept button should auto-fill form fields (structuralConditionRating, and any other predicted values returned) with the suggested values from the prediction result. The Dismiss button hides the panel without modifying form fields. Ensure the photoBase64 field is included in the form submission payload when calling useUpdateInfrastructure. Add loading states during prediction analysis."
        },
        {
          "path": "frontend/src/components/PredictionSuggestionsPanel.tsx",
          "operation": "create",
          "description": "Create a side panel component that displays prediction suggestions when a new photo is uploaded in the edit form. Show the predicted riskScore with RiskBadge, structuralConditionRating (derived from prediction), deteriorationRate, maintenanceYear, and budgetEstimate (estimatedCost formatted as currency). Include two action buttons: Accept Suggestions (calls an onAccept callback to auto-fill parent form fields) and Dismiss (calls an onDismiss callback to hide the panel). Style as a floating panel with dark background, amber accent border, glow effect, and teal highlights for the Accept button. Position the panel to the right side of the form or below on mobile."
        },
        {
          "path": "frontend/src/pages/InfrastructureDetail.tsx",
          "operation": "modify",
          "description": "Update the detail page to display the infrastructure photo if photoBase64 is present. Show the Base64-encoded image as a thumbnail or full-width image above or beside the risk gauge and condition chart. Style the image display with rounded corners, shadow, and glow border consistent with the application theme. Ensure the photo is visible in both view mode and when the InfrastructureEditForm is rendered."
        }
      ]
    }
  ]
}